# TEST ON SLICING AND INDEXING DATAFRAMES

In [2]:
import pandas as pd
import numpy as np
temp = pd.read_csv('../../temperatures.csv', index_col=0)
temp.head()

         date     city        country  avg_temp_c
0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

## 1•  City Temperature Analysis:
	Create an analysis to find the average temperature for each city across different years. Filter the results to show only the cities with an average temperature above 25°C from 2000 to 2010.

In [11]:
temp['year'] = temp['date'].str[:4]
temp_above_25 = temp[temp['avg_temp_c'] > 25]
temp_city_year = temp_above_25.pivot_table('avg_temp_c', index='city', columns='year')
temp_city_year.loc[:, '2000':'2010']

year,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
city,,,,,,,,,,,
Abidjan,27.128300,27.378333,27.046545,27.248000,27.420800,27.427900,26.988083,27.006833,26.944500,27.167182,27.445417
Ahmadabad,29.491111,29.112111,29.775556,29.262444,29.579111,29.552500,28.515800,29.393889,29.093667,29.873667,30.165444
Aleppo,28.872000,28.849500,28.358750,28.530250,28.348250,28.272250,28.622500,29.072000,29.099750,29.462000,29.958500
Alexandria,26.653333,27.434333,27.866667,26.721500,26.784667,27.215333,26.740500,27.008500,27.242000,27.036500,26.932600
Ankara,NaN,NaN,NaN,NaN,NaN,NaN,25.751000,NaN,NaN,NaN,26.044000
...,...,...,...,...,...,...,...,...,...,...,...
Tianjin,27.169333,26.445000,26.816000,25.774500,25.672000,26.441333,26.023333,26.483000,26.385500,26.066333,26.891000
Tokyo,25.528500,26.326000,25.658000,NaN,25.975000,25.567000,25.503000,26.360000,NaN,NaN,26.426500
Umm Durman,31.505556,31.016900,31.579800,30.769000,31.925778,30.929818,30.239636,30.975700,31.251600,31.669500,30.730167
Wuhan,28.379000,27.478750,27.918333,27.724000,27.540000,27.766000,28.773333,28.371333,27.276500,27.862250,27.401750
Xian,25.578000,26.094000,25.513000,NaN,NaN,25.045000,25.957000,NaN,NaN,25.500000,25.722000

## 2•  Country-Based Temperature Trends:
	Identify the cities in 'India' and 'China' and calculate the mean temperature for these cities from 2005 to 2012. Compare the results and determine which country had a higher average temperature during this period.

In [35]:
temp_ind_china = temp[temp['country'].isin(['India', 'China'])]
temp_ind_ch = temp_ind_china.pivot_table('avg_temp_c', index=['country'], columns='year').loc[:,'2005':'2010']

print('India has higher average temperature of 26 degrees')
temp_ind_ch.mean(axis='columns')

India has higher average temperature of 26 degrees

country
China    13.020714
India    26.666893
dtype: float64

## 3•  Maximum Temperature Comparison:
	Find the maximum temperature recorded for each city and then subset the data to include only the top 5 cities with the highest maximum temperatures. List these cities and their corresponding maximum temperatures.

## 4•  Yearly Temperature Range:
	Create a pivot table to show the range (difference between maximum and minimum) of temperatures for each city for the years 2003 to 2008. Identify the city with the highest range of temperatures.

## 5•  Seasonal Temperature Variations:
	Extract data for the months of June, July, and August for the years 2000 to 2010. Determine which city had the highest average summer temperature and provide the details.

## 6•  Multi-Level Index Analysis:
	Set a multi-level index with 'country' and 'city'. Slice the data to get temperature records for 'Australia' and 'Brazil' for the years 2001 to 2005. Calculate the average temperature for each city in these countries during this period.

## 7•  Date-Based Slicing:
	The dataset is indexed by date. Slice the data to extract temperatures for the period from '2007-01-01' to '2009-12-31'. Identify the city with the lowest recorded temperature within this date range and provide the details.

## 8•  Temperature Extremes:
	Find the cities that recorded temperatures below 10°C or above 35°C at any point in the dataset. Create a list of these cities along with the respective minimum and maximum temperatures recorded.

## 9•  Pivot Table with Missing Values:
	Create a pivot table to find the average temperature for each city in 'United States' and 'Canada' for each year from 2000 to 2010. Fill any missing values with the overall average temperature of the respective country.

## 10•  Historical Temperature Comparison:
	Compare the average temperatures of 'London' and 'New York' for each year from 2000 to 2012. Identify the year in which the difference in average temperature between these two cities was the greatest and provide the details.